# CitySet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
CitySet Constructor
CitySet Class See Also
---
Initializes a new instance of the CitySet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CitySet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CitySet()
```

# See Also
CitySet Class
Autodesk.Revit.DB Namespace